# Analysis for Future Expansion Opportunities

## Introduction

The Vehicle Distributors, a fictional wholesale distributor of die cast vehicle models, operates globally with customers in over 15 countries. The company has approached us with a dataset analysis task to help them make critical decisions regarding potential future expansion. The objective of this project is to address their inquiries and provide data-driven answers by examining the available data.

The provided dataset, along with its corresponding schema, can be found [here](https://www.mysqltutorial.org/mysql-sample-database.aspx). The scale model cars database contains eight tables:

__Customers__: customer data <br>
__Employees__: all employee information <br>
__Offices__: sales office information <br>
__Orders__: customers' sales orders <br>
__OrderDetails__: sales order line for each sales order <br>
__Payments__: customers' payment records <br>
__Products__: a list of scale model cars <br>
__ProductLines__: a list of product line categories <br>

In [1]:
# Importing all required libraries
import sqlite3
import pandas as pd
import plotly.express as px

In [2]:
# loading the extension
%load_ext sql

# initializing the connection to existing database.
%sql sqlite:///stores.db

In [3]:
conn = sqlite3.connect('stores.db')

## Exploring the Data Set

Here you can see below is the Database Schema, we'll need this to understand how each chart connects to each other.

<img src='Map.png'>

Let's begin by sampling each table:

__Customers__

In [4]:
%%sql
SELECT *
  FROM customers
 LIMIT 5;

 * sqlite:///stores.db
Done.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, 21000),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 'USA', 1166, 71800),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, 117300),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, 118200),
 (121, 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, 'Stavern', None, '4110', 'Norway', 1504, 81700)]

__Employees__

In [5]:
%%sql
SELECT *
  FROM employees
 LIMIT 5;

 * sqlite:///stores.db
Done.

[(1002, 'Murphy', 'Diane', 'x5800', 'dmurphy@classicmodelcars.com', '1', None, 'President'),
 (1056, 'Patterson', 'Mary', 'x4611', 'mpatterso@classicmodelcars.com', '1', 1002, 'VP Sales'),
 (1076, 'Firrelli', 'Jeff', 'x9273', 'jfirrelli@classicmodelcars.com', '1', 1002, 'VP Marketing'),
 (1088, 'Patterson', 'William', 'x4871', 'wpatterson@classicmodelcars.com', '6', 1056, 'Sales Manager (APAC)'),
 (1102, 'Bondur', 'Gerard', 'x5408', 'gbondur@classicmodelcars.com', '4', 1056, 'Sale Manager (EMEA)')]

__Offices__

In [6]:
%%sql
SELECT *
  FROM offices
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('1', 'San Francisco', '+1 650 219 4782', '100 Market Street', 'Suite 300', 'CA', 'USA', '94080', 'NA'),
 ('2', 'Boston', '+1 215 837 0825', '1550 Court Place', 'Suite 102', 'MA', 'USA', '02107', 'NA'),
 ('3', 'NYC', '+1 212 555 3000', '523 East 53rd Street', 'apt. 5A', 'NY', 'USA', '10022', 'NA'),
 ('4', 'Paris', '+33 14 723 4404', "43 Rue Jouffroy D'abbans", None, None, 'France', '75017', 'EMEA'),
 ('5', 'Tokyo', '+81 33 224 5000', '4-1 Kioicho', None, 'Chiyoda-Ku', 'Japan', '102-8578', 'Japan')]

__Orders__

In [7]:
%%sql
SELECT *
  FROM orders
 LIMIT 5;

 * sqlite:///stores.db
Done.

[(10100, '2003-01-06', '2003-01-13', '2003-01-10', 'Shipped', None, 363),
 (10101, '2003-01-09', '2003-01-18', '2003-01-11', 'Shipped', 'Check on availability.', 128),
 (10102, '2003-01-10', '2003-01-18', '2003-01-14', 'Shipped', None, 181),
 (10103, '2003-01-29', '2003-02-07', '2003-02-02', 'Shipped', None, 121),
 (10104, '2003-01-31', '2003-02-09', '2003-02-01', 'Shipped', None, 141)]

__Order Details__

In [8]:
%%sql
SELECT *
  FROM orderdetails
 LIMIT 5;

 * sqlite:///stores.db
Done.

[(10100, 'S18_1749', 30, 136, 3),
 (10100, 'S18_2248', 50, 55.09, 2),
 (10100, 'S18_4409', 22, 75.46, 4),
 (10100, 'S24_3969', 49, 35.29, 1),
 (10101, 'S18_2325', 25, 108.06, 4)]

__Payments__

In [9]:
%%sql
SELECT *
  FROM payments
 LIMIT 5;

 * sqlite:///stores.db
Done.

[(103, 'HQ336336', '2004-10-19', 6066.78),
 (103, 'JM555205', '2003-06-05', 14571.44),
 (103, 'OM314933', '2004-12-18', 1676.14),
 (112, 'BO864823', '2004-12-17', 14191.12),
 (112, 'HQ55022', '2003-06-06', 32641.98)]

__Products__

In [10]:
%%sql
SELECT *
  FROM products
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('S10_1678', '1969 Harley Davidson Ultimate Chopper', 'Motorcycles', '1:10', 'Min Lin Diecast', 'This replica features working kickstand, front suspension, gear-shift lever, footbrake lever, drive chain, wheels and steering. All parts are particularly delicate due to their precise scale and require special care and attention.', 7933, 48.81, 95.7),
 ('S10_1949', '1952 Alpine Renault 1300', 'Classic Cars', '1:10', 'Classic Metal Creations', 'Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 7305, 98.58, 214.3),
 ('S10_2016', '1996 Moto Guzzi 1100i', 'Motorcycles', '1:10', 'Highway 66 Mini Classics', 'Official Moto Guzzi logos and insignias, saddle bags located on side of motorcycle, detailed engine, working steering, working suspension, two leathe ... (93 characters truncated) ... paint with chrome accents, superior die-cast detail , rotating wheels , working kick stand, diecast metal with plastic parts and baked enamel finish.', 6625, 68.99, 118.94),
 ('S10_4698', '2003 Harley-Davidson Eagle Drag Bike', 'Motorcycles', '1:10', 'Red Start Diecast', 'Model features, official Harley Davidson logos and insignias, detachable rear wheelie bar, heavy diecast metal with resin parts, authentic multi-colo ... (201 characters truncated) ... t replica, baked enamel finish, 1:10 scale model, removable fender, seat and tank cover piece for displaying the superior detail of the v-twin engine', 5582, 91.02, 193.66),
 ('S10_4757', '1972 Alfa Romeo GTA', 'Classic Cars', '1:10', 'Motor City Art Classics', 'Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 3252, 85.68, 136)]

__Product Lines__

In [11]:
%%sql
SELECT *
  FROM productlines
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('Classic Cars', 'Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking for classic muscle cars, dream sports cars or mo ... (437 characters truncated) ... cles. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.', None, None),
 ('Motorcycles', 'Our motorcycles are state of the art replicas of classic as well as contemporary motorcycle legends such as Harley Davidson, Ducati and Vespa. Models ... (297 characters truncated) ...  out-of-production vehicles. All models come fully assembled and ready for display in the home or office. Most include a certificate of authenticity.', None, None),
 ('Planes', 'Unique, diecast airplane and helicopter replicas suitable for collections, as well as home, office or classroom decorations. Models contain stunning  ... (55 characters truncated) ... jet engines and propellers, retractable wheels, and so on. Most come fully assembled and with a certificate of authenticity from their manufacturers.', None, None),
 ('Ships', 'The perfect holiday or anniversary gift for executives, clients, friends, and family. These handcrafted model ships are unique, stunning works of art ... (12 characters truncated) ... e treasured for generations! They come fully assembled and ready for display in the home or office. We guarantee the highest quality, and best value.', None, None),
 ('Trains', "Model trains are a rewarding hobby for enthusiasts of all ages. Whether you're looking for collectible wooden trains, electric streetcars or locomoti ... (73 characters truncated) ... egory. The interactive aspect of trains makes toy trains perfect for young children. The wooden train sets are ideal for children under the age of 5.", None, None)]

Let's see what unique products they offer

In [12]:
%%sql 
SELECT DISTINCT productLine 
  FROM productlines p;

 * sqlite:///stores.db
Done.

[('Classic Cars',),
 ('Motorcycles',),
 ('Planes',),
 ('Ships',),
 ('Trains',),
 ('Trucks and Buses',),
 ('Vintage Cars',)]

Let's look at where our Customer Base comes from

In [13]:
%%sql 
SELECT country, COUNT(customerNumber) AS Customers
  FROM customers c
 GROUP BY country
 ORDER BY customers DESC;

 * sqlite:///stores.db
Done.

[('USA', 36),
 ('Germany', 13),
 ('France', 12),
 ('Spain', 7),
 ('UK', 5),
 ('Australia', 5),
 ('New Zealand', 4),
 ('Italy', 4),
 ('Switzerland', 3),
 ('Singapore', 3),
 ('Finland', 3),
 ('Canada', 3),
 ('Sweden', 2),
 ('Portugal', 2),
 ('Norway  ', 2),
 ('Japan', 2),
 ('Ireland', 2),
 ('Denmark', 2),
 ('Belgium', 2),
 ('Austria', 2),
 ('South Africa', 1),
 ('Russia', 1),
 ('Poland', 1),
 ('Philippines', 1),
 ('Norway', 1),
 ('Netherlands', 1),
 ('Israel', 1),
 ('Hong Kong', 1)]

In [14]:
# Retrieve in a single table the table name as a string, 
# the number of attributes and also the number of rows in each table.

In [15]:
%%sql 
SELECT 'Customers' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM customers) AS number_of_rows 
  FROM pragma_table_info('customers')

UNION ALL

SELECT 'products' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM products) AS number_of_rows 
  FROM pragma_table_info('products')

UNION ALL

SELECT 'productlines' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM productlines) AS number_of_rows 
  FROM pragma_table_info('productlines')

UNION ALL

SELECT 'orders' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM orders) AS number_of_rows 
  FROM pragma_table_info('orders')

UNION ALL

SELECT 'orderdetails' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM orderdetails) AS number_of_rows 
  FROM pragma_table_info('orderdetails')

UNION ALL

SELECT 'payments' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM payments) AS number_of_rows 
  FROM pragma_table_info('payments')

UNION ALL

SELECT 'employees' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM employees) AS number_of_rows 
  FROM pragma_table_info('employees')

UNION ALL

SELECT 'offices' table_name, 
        COUNT(*) AS number_of_attributes,
        (SELECT COUNT(*)
           FROM offices) AS number_of_rows 
  FROM pragma_table_info('offices')

 * sqlite:///stores.db
Done.

[('Customers', 13, 122),
 ('products', 9, 110),
 ('productlines', 4, 7),
 ('orders', 7, 326),
 ('orderdetails', 5, 2996),
 ('payments', 4, 273),
 ('employees', 8, 23),
 ('offices', 9, 7)]

##  Question 1: Which Products Should We Order More of or Less of?

Now that we know the database a little better, we can answer the first question: which products should we order more of or less of? This question refers to inventory reports, including low stock(i.e. product in demand) and product performance. This will optimize the supply and the user experience by preventing the best-selling products from going out-of-stock.

-The low stock represents the quantity of the sum of each product ordered divided by the quantity of product in stock. We can consider the ten highest rates. These will be the top ten products that are almost out-of-stock or completely out-of-stock.<br>

-The product performance represents the sum of sales per product.<br>

-Priority products for restocking are those with high product performance that are on the brink of being out of stock.<br>

<img src='Image2.png'>

__Calculating Low Stock Items__

In [16]:
%%sql 
SELECT p.productname, p.productcode, (SUM(od.quantityordered)/p.quantityinstock) AS LOW_STOCK
  FROM products p
  JOIN orderdetails od
    ON p.productcode = od.productcode
 GROUP BY p.productcode
 ORDER BY LOW_STOCK DESC
 LIMIT 10;

 * sqlite:///stores.db
Done.

[('1960 BSA Gold Star DBD34', 'S24_2000', 67),
 ('1968 Ford Mustang', 'S12_1099', 13),
 ('1928 Ford Phaeton Deluxe', 'S32_4289', 7),
 ('1997 BMW F650 ST', 'S32_1374', 5),
 ('Pont Yacht', 'S72_3212', 2),
 ('F/A 18 Hornet 1/72', 'S700_3167', 1),
 ('The Mayflower', 'S700_1938', 1),
 ('2002 Yamaha YZR M1', 'S50_4713', 1),
 ('1996 Peterbilt 379 Stake Bed with Outrigger', 'S32_3522', 1),
 ('1928 Mercedes-Benz SSK', 'S18_2795', 1)]

__Calculating Product Performance__

In [17]:
%%sql 
SELECT p.productname, p.productcode, ROUND(SUM(od.quantityordered + od.priceeach),2) AS Product_Performance
  FROM products p
  JOIN orderdetails od
    ON p.productcode = od.productcode
 GROUP BY p.productcode
 ORDER BY Product_Performance DESC
  LIMIT 10;

 * sqlite:///stores.db
Done.

[('1992 Ferrari 360 Spider red', 'S18_3232', 9882.17),
 ('1952 Alpine Renault 1300', 'S10_1949', 6485.66),
 ('2001 Ferrari Enzo', 'S12_1108', 6070.61),
 ('2003 Harley-Davidson Eagle Drag Bike', 'S10_4698', 5809.07),
 ('1968 Ford Mustang', 'S12_1099', 5589.05),
 ('1969 Ford Falcon', 'S12_3891', 5236.91),
 ('1928 Mercedes-Benz SSK', 'S18_2795', 5076.85),
 ('1998 Chrysler Plymouth Prowler', 'S18_2238', 5022.0),
 ('1980s Black Hawk Helicopter', 'S18_1662', 4934.95),
 ('1917 Grand Touring Sedan', 'S18_1749', 4760.0)]

__Finding ReStock Priority__

In [18]:
# Combine the previous queries using a Common Table Expression (CTE) to 
# display priority products for restocking using the IN operator.

In [19]:
%%sql 
SELECT productname, productcode, Product_Performance, LOW_STOCK
  FROM (
        SELECT p.productname, p.productcode, 
               ROUND(SUM(od.quantityordered + od.priceeach), 2) AS Product_Performance,
              (SUM(od.quantityordered) / p.quantityinstock) AS LOW_STOCK
         FROM products p
         JOIN orderdetails od ON p.productcode = od.productcode
        GROUP BY p.productcode
       ) AS Subquery
  WHERE productcode IN (
                        SELECT productcode
                          FROM (
                                SELECT p.productcode, (SUM(od.quantityordered) / p.quantityinstock) AS LOW_STOCK
                                  FROM products p
                                  JOIN orderdetails od ON p.productcode = od.productcode
                                 GROUP BY p.productcode
                                 ORDER BY LOW_STOCK DESC
                                 LIMIT 5
                               ) AS TopProducts
)
 ORDER BY LOW_STOCK DESC;

 * sqlite:///stores.db
Done.

[('1960 BSA Gold Star DBD34', 'S24_2000', 2867.48, 67),
 ('1968 Ford Mustang', 'S12_1099', 5589.05, 13),
 ('1928 Ford Phaeton Deluxe', 'S32_4289', 2713.08, 7),
 ('1997 BMW F650 ST', 'S32_1374', 3497.25, 5),
 ('Pont Yacht', 'S72_3212', 2291.87, 2)]

In [20]:
## The 'Where' portion above is honestly not needed, but to work with the lesson plan I added it.
##It's essentially just sorting by the top 5.

## Question 2: How Should We Match Marketing and Communication Strategies to Customer Behavior?

In the first part of this project, we explored products. Now we'll explore customer information by answering the second question: how should we match marketing and communication strategies to customer behaviors? This involves categorizing customers: finding the VIP (very important person) customers and those who are less engaged.

-VIP customers bring in the most profit for the store.<br>
-Less-engaged customers bring in less profit.<br>

For example, we could organize some events to drive loyalty for the VIPs and launch a campaign for the less engaged.

Before we begin, let's compute how much profit each customer generates.

We'll need these tables:

<img src='Image3.png'>

In [21]:
%%sql 
SELECT o.customernumber,ROUND((SUM(od.quantityOrdered * (od.priceEach - p.buyPrice))),2) AS CustomerProfit
  FROM orderdetails od
 INNER JOIN orders o 
    ON od.ordernumber = o.ordernumber
 INNER JOIN products p
    ON od.productcode = p.productcode
 GROUP BY o.customernumber
 ORDER BY CustomerProfit DESC
 LIMIT 10;

 * sqlite:///stores.db
Done.

[(141, 326519.66),
 (124, 236769.39),
 (151, 72370.09),
 (114, 70311.07),
 (119, 60875.3),
 (148, 60477.38),
 (187, 60095.86),
 (323, 60013.99),
 (131, 58669.1),
 (450, 55931.37)]

Using a CTE we'll make a new Query to find the VIP's

In [22]:
##How this works is we're creating a seperate chart with the "WITH" code named "Performance"
##We can then call to this new chart whenever we like in the code beneath.

In [23]:
%%sql
WITH performance AS
  (SELECT o.customerNumber, round(SUM(od.quantityOrdered * (od.priceEach - p.buyPrice)),2) AS profit
     FROM orders o
     JOIN orderdetails od 
       ON od.orderNumber = o.orderNumber
     JOIN products p 
       ON p.productCode = od.productCode
    GROUP BY o.customerNumber
    ORDER BY profit DESC
  )

SELECT c.contactLastName ||" "||c.contactFirstName AS Name,c.city,c.country, profit, performance.customernumber
  FROM customers c 
  JOIN performance 
    ON performance.customerNumber = c.customerNumber 
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('Freyre Diego ', 'Madrid', 'Spain', 326519.66, 141),
 ('Nelson Susan', 'San Rafael', 'USA', 236769.39, 124),
 ('Young Jeff', 'NYC', 'USA', 72370.09, 151),
 ('Ferguson Peter', 'Melbourne', 'Australia', 70311.07, 114),
 ('Labrune Janine ', 'Nantes', 'France', 60875.3, 119)]

Now that we've found the TOP - 5 VIP's, let's look for the TOP - 5 least engaged customers

In [24]:
## All we're really doing is flipping the Profit value ordering from DESC to ASC

In [25]:
%%sql
WITH performance AS
  (SELECT o.customerNumber, round(SUM(od.quantityOrdered * (od.priceEach - p.buyPrice)),2) AS profit
     FROM orders o
     JOIN orderdetails od 
       ON od.orderNumber = o.orderNumber
     JOIN products p 
       ON p.productCode = od.productCode
    GROUP BY o.customerNumber
    ORDER BY profit ASC
  )

SELECT c.contactFirstName ||" "||c.contactLastName AS Name,c.city,c.country, profit, performance.customernumber
  FROM customers c 
  JOIN performance 
    ON performance.customerNumber = c.customerNumber 
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('Mary Young', 'Glendale', 'USA', 2610.87, 219),
 ('Leslie Taylor', 'Brickhaven', 'USA', 6586.02, 198),
 ('Franco Ricotti', 'Milan', 'Italy', 9532.93, 473),
 ('Carine  Schmitt', 'Nantes', 'France', 10063.8, 103),
 ('Thomas  Smith', 'London', 'UK', 10868.04, 489)]

## Question 3: How Much Can We Spend on Acquiring New Customers?

Before answering this question, let's find the number of new customers arriving each month. That way we can check if it's worth spending money on acquiring new customers. This query helps to find these numbers.

In [26]:
%%sql
WITH 

payment_with_year_month_table AS (
       SELECT *, 
              CAST(SUBSTR(paymentDate, 1,4) AS INTEGER)*100 + CAST(SUBSTR(paymentDate, 6,7) AS INTEGER) AS year_month
         FROM payments p
),

customers_by_month_table AS (
       SELECT p1.year_month, COUNT(*) AS number_of_customers, SUM(p1.amount) AS total
         FROM payment_with_year_month_table p1
        GROUP BY p1.year_month
),

new_customers_by_month_table AS (
       SELECT p1.year_month, 
              COUNT(*) AS number_of_new_customers,
              SUM(p1.amount) AS new_customer_total,
              (SELECT number_of_customers
                 FROM customers_by_month_table c
                WHERE c.year_month = p1.year_month) AS number_of_customers,
                      (SELECT total
                         FROM customers_by_month_table c
                         WHERE c.year_month = p1.year_month) AS total
          FROM payment_with_year_month_table p1
         WHERE p1.customerNumber NOT IN (SELECT customerNumber
                                           FROM payment_with_year_month_table p2
                                          WHERE p2.year_month < p1.year_month)
         GROUP BY p1.year_month
)

SELECT year_month, 
       ROUND(number_of_new_customers*100/number_of_customers,1) AS number_of_new_customers_props,
       ROUND(new_customer_total*100/total,1) AS new_customers_total_props
  FROM new_customers_by_month_table;

 * sqlite:///stores.db
Done.

[(200301, 100.0, 100.0),
 (200302, 100.0, 100.0),
 (200303, 100.0, 100.0),
 (200304, 100.0, 100.0),
 (200305, 100.0, 100.0),
 (200306, 100.0, 100.0),
 (200307, 75.0, 68.3),
 (200308, 66.0, 54.2),
 (200309, 80.0, 95.9),
 (200310, 69.0, 69.3),
 (200311, 57.0, 53.9),
 (200312, 60.0, 54.9),
 (200401, 33.0, 41.1),
 (200402, 33.0, 26.5),
 (200403, 54.0, 55.0),
 (200404, 40.0, 40.3),
 (200405, 12.0, 17.3),
 (200406, 33.0, 43.9),
 (200407, 10.0, 6.5),
 (200408, 18.0, 26.2),
 (200409, 40.0, 56.4)]

As you can see, the number of clients has been decreasing since 2003, and in 2004, we had the lowest values. The year 2005, which is present in the database as well, isn't present in the table above, this means that the store has not had any new customers since September of 2004. This means it makes sense to spend money acquiring new customers.

To determine how much money we can spend acquiring new customers, we can compute the Customer Lifetime Value (LTV), which represents the average amount of money a customer generates. We can then determine how much we can spend on marketing.

In [27]:
%%sql
WITH performance AS
  (SELECT o.customerNumber, round(SUM(od.quantityOrdered * (od.priceEach - p.buyPrice)),2) AS profit
     FROM orders o
     JOIN orderdetails od 
       ON od.orderNumber = o.orderNumber
     JOIN products p 
       ON p.productCode = od.productCode
    GROUP BY o.customerNumber
    ORDER BY profit DESC
  )

SELECT ROUND(AVG(profit),2) as LTV
  FROM performance

 * sqlite:///stores.db
Done.

[(39039.59,)]

LTV tells us how much profit an average customer generates during their lifetime with our store. We can use it to predict our future profit. So, if we get ten new customers next month, we'll earn 390,395 dollars, and we can decide based on this prediction how much we can spend on acquiring new customers.

## Conclusion